{
  "version": "https://jsonfeed.org/version/1",
  "user_comment": "This feed allows you to read the posts from this site in any feed reader that supports the JSON Feed format. To add this feed to your reader, copy the following URL — https://anandchowdhary.com/feed.json — and add it your reader.",
  "title": "Anand Chowdhary",
  "description": "Anand Chowdhary is a creative technologist and entrepreneur. He is the founder and CEO of Oswald Labs, an accessibility technology company.",
  "home_page_url": "https://anandchowdhary.com/",
  "feed_url": "https://anandchowdhary.com/feed.json",
  "author": {
    "name": "Anand Chowdhary",
    "url": "https://anandchowdhary.com/",
    "avatar": "https://avatars3.githubusercontent.com/u/2841780?s=460&amp;v=4"
  },
  "items": [
    
    {
      "title": "The Defence for MD5",
      "date_published": "2017-02-26T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/md5/",
      "url": "https://anandchowdhary.com/blog/md5/",
      "content_html": "&lt;p&gt;A few days ago, I tried to reset my password on &lt;a href=&quot;http://pr.com/&quot;&gt;PR.com&lt;/a&gt;, the press releases website. I entered my email, and they sent me the username and password in plain text. That’s right, in plain text.&lt;/p&gt;&lt;!--more--&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Screenshot of email&quot; src=&quot;https://anandchowdhary.com/images/blog/md5-pr_wav36p.png&quot;&gt;&lt;/div&gt;&lt;p&gt;The problem with this method of password storage is that if anyone gets access to your database, they can literally just see the passwords. This is why hashing is used, which converts the plain text password to an encrypted “hashed” version that is, in an ideal world, undecryptable. The problem with this hashing is really about how hashing fundamentally works: collisions are not uncommon, i.e., multiple strings could have the same hashed string.&lt;/p&gt;&lt;p&gt;For example, if the hash function converts all vowels to “X”, then the hash of “Hello” is “HXllX” and the hash of “Hille” is also “HXIIX”, even though the original strings are definitely distinct. Of course, real world hashing functions are mathematically complex, but collisions are still not that uncommon. This is why the MD5 and more recently SHA-1 hashing algorithms aren’t recommended for security usages, and larger ones such as SHA-256 which don’t have any proven collisions so far are.&lt;/p&gt;&lt;p&gt;These two strings have the same MD5 hash:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;String 1: 4dc968ff0ee35c209572d4777b721587d36fa7b21bdc56b74a3dc0783e7b9518afbfa200a8284bf36e8e4b55b35f427593d849676da0d1555d8360fb5f07fea2String 2: 4dc968ff0ee35c209572d4777b721587d36fa7b21bdc56b74a3dc0783e7b9518afbfa202a8284bf36e8e4b55b35f427593d849676da0d1d55d8360fb5f07fea2Hash:     008ee33a9d58b51cfeb425b0959121c9&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;The next thing step to safe password storage is called salting. Salting is essentially inserting characters in the string before hashing it. “Hello” can become “H1e2l3lo” if you insert “123” after every alternate character. This means that the hashed file is now much more secure because an intruder would have to know the specific salting technique, which is usually based on server timestamp, tokens, or something unguessable.&lt;/p&gt;&lt;p&gt;Now, even though collisions are common in MD5, it’s still much much better at storing sensitive information than plain text. Since intruders usually just match your hashed file to hashes of common passwords, dictionary words, combinations, etc., if you have a nice, long password, the brute force method becomes inefficient.&lt;/p&gt;&lt;p&gt;This is why, as long as passwords are lengthy and therefore relatively secure, “outdated” hashing algorithms such as MD5 are also actually not a bad choice if it’s as simple as &lt;code&gt;md5($string)&lt;/code&gt; vs &lt;code&gt;$string&lt;/code&gt; when storing the password. I have a nice long Facebook password, and I’ve decided to make its MD5 hash public to prove my point:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;cf7dd0b01c061029778c72facdc14451&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Even though it’s &lt;em&gt;just&lt;/em&gt; MD5, I don’t think anyone can decrypt it. Not for 573 quadrillion years, at least.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Footnote:&lt;/strong&gt; I’m not saying that we should use MD5 to sign TLS certificates, that’s crazy talk. All I’m saying is that (a) MD5 is better than plain text, and (b) it works for practical purposes, as long as there’s no sensitive data to be accessed and the user has a long, non-dictionary password.&lt;/p&gt;"
    },
    
    {
      "title": "Life Update: College",
      "date_published": "2017-03-01T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/college/",
      "url": "https://anandchowdhary.com/blog/college/",
      "content_html": "&lt;p&gt;Just a little bit of background about my college “situation”. How I went from design school in India to back to New Delhi to the University of Twente in the Netherlands. I wrote this post in March 2017 and updated it in December 2017.&lt;/p&gt;&lt;!--more--&gt;&lt;p&gt;I graduated from highschool in April 2016 and joined the Unitedworld Institute of Design (UID) in Ahmedabad, Gujarat, after working at the Government of Delhi for a month. UID was an excellent college for people who want to study design using the fundamentals of art.&lt;/p&gt;&lt;p&gt;The problem I faced at UID was that the first year, the Foundation, was really more art and design. Instead of design thinking and languages and designers, it was more about sketching and painting and artists. The way I think design should be taught, really what I feel design is, was very different from their philosophy. So, after two short months, I decided to drop out of UID. I moved back to Delhi and founded Oswald Foundation, the accessibility technology company I’m leading.&lt;/p&gt;&lt;p&gt;Oswald went on to become really great, and it mainly started with us winning Startup India Rocks! 2016 and I decided that it’s worthwhile. This January, I applied to a few universities I liked just to keep my options open, in case I wish to continue my formal education. Even though Oswald is going great, I figured it’s no harm in applying.&lt;/p&gt;&lt;h2 id=&quot;accepted&quot;&gt;Accepted &lt;a class=&quot;direct-link&quot; href=&quot;#accepted&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;ul&gt;&lt;li&gt;Digital Media at RMIT University&lt;/li&gt;&lt;li&gt;Digital Media &amp;amp; Visual Communication at HTK Berlin&lt;/li&gt;&lt;li&gt;Interaction Design at Harbour.Space University (1 year scholarship)&lt;/li&gt;&lt;li&gt;Interaction Design at The Glasgow School of Art&lt;/li&gt;&lt;li&gt;Information Technology with UX at University of Queensland&lt;/li&gt;&lt;li&gt;Digital Media Design at University of Hertfordshire&lt;/li&gt;&lt;li&gt;Applied Computer Science (Mobile Computing) at Sheridan College&lt;/li&gt;&lt;li&gt;Interaction Design Arts at University of the Arts London’s College of Communication&lt;/li&gt;&lt;li&gt;Interaction Design at California College of the Arts (Creative Achievement scholarship, $80,000)&lt;/li&gt;&lt;li&gt;Interaction Design at Norwich University of the Arts&lt;/li&gt;&lt;li&gt;Creative Technology at the University of Twente&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;rejected&quot;&gt;Rejected &lt;a class=&quot;direct-link&quot; href=&quot;#rejected&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;ul&gt;&lt;li&gt;Digital and Interaction Design at BTK University, Berlin, because I needed a foundation year to apply for that program. I did not know that.&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;footnotes&quot;&gt;Footnotes &lt;a class=&quot;direct-link&quot; href=&quot;#footnotes&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;University of Twente’s Creative Technology program is my absolute favorite right now. If I have to choose a course, I would pick this program because it’s the perfect blend of creativity/design, engineering, and computer science — everything I love.&lt;/p&gt;&lt;p&gt;I did not apply to study to the US, except for CCA because it’s been my dream college since I was in sixth grade. I really loved the Interaction Design program at CCA when I was younger, but I see the parallels between UID and CCA in retrospect.&lt;/p&gt;&lt;h2 id=&quot;update&quot;&gt;Update &lt;a class=&quot;direct-link&quot; href=&quot;#update&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;In August 2017, I moved to Enschede, the Netherlands, and started studying Creative Technology at the University of Twente.&lt;/p&gt;"
    },
    
    {
      "title": "Zomato for Android Redesign",
      "date_published": "2017-04-11T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/zomato/",
      "url": "https://anandchowdhary.com/blog/zomato/",
      "content_html": "&lt;p&gt;I took fifteen minutes to make some strategic design changes to Zomato’s Android app. I wrote extensively about the iconography, typography, and role of actions in the app’s user experience. I wrote this article originally in March 2016 for the Zomato Android team and publicly published it on Medium in April 2017 since Zomato decided to implement most of my design changes.&lt;/p&gt;"
    },
    
    {
      "title": "UTwente PeoplePages Contact Book",
      "date_published": "2017-08-12T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/utwente-peoplepages/",
      "url": "https://anandchowdhary.com/blog/utwente-peoplepages/",
      "content_html": "&lt;p&gt;As a future creative technology student at the University of Twente, I wanted to get in touch with a particular professor. Their website, &lt;a href=&quot;https://people.utwente.nl/&quot;&gt;PeoplePages&lt;/a&gt;, uses a RESTful API for AJAX requests to search for university staff, so I decided to add everyone to my contacts using API scraping to save time in the future.&lt;/p&gt;&lt;!--more--&gt;&lt;p&gt;I did a query to find all results starting with the letter “a” and got a minified JSON response with all data. Fortunately, they have unrestricted access to their endpoints. This is what it looks like when cleaned:&lt;/p&gt;&lt;pre&gt;&lt;code&gt;GET https://people.utwente.nl/search?query=a&lt;/code&gt;&lt;/pre&gt;&lt;pre&gt;&lt;code class=&quot;language-json&quot;&gt;{  &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;data&amp;quot;&lt;/span&gt;: [    {      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;person&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;id&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;10000000000XXXX&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;name&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;John Doe&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;jobtitle&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;Supporting Staff&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;avatar&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;https://people.utwente.nl/john.doe/picture.jpg&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;profile&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;https://people.utwente.nl/john.doe&amp;quot;&lt;/span&gt;,      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;organizations&amp;quot;&lt;/span&gt;: [        {          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;code&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;S&amp;amp;B-XXXX&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;department&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;S&amp;amp;B&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;section&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;XXXX&amp;quot;&lt;/span&gt;        }      ],      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;locations&amp;quot;&lt;/span&gt;: [        {          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;description&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;Enschede 320&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;latitude&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-number&quot;&gt;52.23979&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;longitude&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-number&quot;&gt;6.850018&lt;/span&gt;        }      ],      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;phones&amp;quot;&lt;/span&gt;: [        {          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;type&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;tel&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;+3153489XXXX&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;prefix&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;+3153489&amp;quot;&lt;/span&gt;,          &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;ext&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;XXXX&amp;quot;&lt;/span&gt;        }      ],      &lt;span class=&quot;hljs-attr&quot;&gt;&amp;quot;email&amp;quot;&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;john.doe@utwente.nl&amp;quot;&lt;/span&gt;    }  ]}&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;and so on. Since empty searches, space searches, and others weren’t working, I decided to query each letter of the alphabet and save the JSON result to play with it:&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-bash&quot;&gt;wget https://people.utwente.nl/search?query={a..z}&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;I soon realized that this wouldn’t work because the API restricts the number of results to 50, but this would:&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-sh&quot;&gt;wget https://people.utwente.nl/search?query={a..z}{a..z}&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;This goes through every combination in the alphabet: aa, ab, ac . . . zx, zy, zz, and downloads the JSON file. This was enough, but in many combinations like xx, xz, etc., there were no results, so the empty JSON file was exactly 43 bytes with just the JSON structure. I then got rid of those files:&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-sh&quot;&gt;find . -name &lt;span class=&quot;hljs-string&quot;&gt;&amp;quot;*&amp;quot;&lt;/span&gt; -size 43c -delete&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;This Bash command finds all files that are of 43 bytes in size and deletes them. Note that if I just filter the size in bytes and query something like &lt;code&gt;-size 43 -delete&lt;/code&gt;, it interprets it as 43*512 bytes, so the &lt;a href=&quot;https://superuser.com/a/644274&quot;&gt;POSIX requirement&lt;/a&gt; states “c” for bytes.&lt;/p&gt;&lt;p&gt;Finally I concatenated all the JSON files to one giant 4.9 MB file.&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-sh&quot;&gt;cat * &amp;gt; contacts.json&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;After cleaning the file, removing business contacts, and generally playing with the JSON content, I have a directory of 7527 people including duplicates. Sublime Text can handle this for me, with the simple command: Edit -&amp;gt; Permute Lines -&amp;gt; Unique. I now have 3740 people.&lt;/p&gt;&lt;p&gt;Then, I clean up by replacing double space with single, change the “Surname, Firstname” format to “Firstname Surname”, and saved the contacts in a CSV file.&lt;/p&gt;&lt;p&gt;I now have the phone numbers, email addresses, and office addresses of all my professors, the Dean, and other important contacts for the university in my phone’s contact book. Simple enough.&lt;/p&gt;&lt;h2 id=&quot;security&quot;&gt;Security &lt;a class=&quot;direct-link&quot; href=&quot;#security&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;The simple way to prevent this is to have secured API endpoints. There are many ways to do that — token-based authentication for each user with rate limiting, or even CORS prevention.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Screenshot of Google Search results for &#39;secure api endpoints&#39;&quot; src=&quot;https://anandchowdhary.com/images/blog/secure-endpoints_ddwwmr.png&quot;&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Update May 2018:&lt;/strong&gt; Since then, the university has updated their endpoints. You cannot access them by barebones HTTP now. The new endpoints also seem to have some form of CORS protection.&lt;/p&gt;"
    },
    
    {
      "title": "State of the Podcasts 2018",
      "date_published": "2018-05-28T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/state-of-the/podcasts/2018/",
      "url": "https://anandchowdhary.com/blog/state-of-the/podcasts/2018/",
      "content_html": "&lt;p&gt;I started &lt;em&gt;really&lt;/em&gt; consuming audio content in the form of podcasts and audiobooks about two years ago, and I’m very often asked what podcasts I listen to. This is the first list in a series of reviews about my daily drivers of content, services, and products.&lt;/p&gt;&lt;!--more--&gt;&lt;p&gt;I first started heavily listening to podcasts when I joined the gym (that didn’t last) for about half a year. In my last year in Delhi (I moved in September 2017), I travelled at least an hour or two on average per day, and that was also a great time to consume audio content.&lt;/p&gt;&lt;p&gt;Ever since I moved to the Netherlands, I’ve been biking for between 30 and 45 minutes every day, and now that’s become my go-to time for listening to podcasts, apart from any other travel time.&lt;/p&gt;&lt;p&gt;I’ve divided this list in three categories — definitely, probably, and generally.&lt;/p&gt;&lt;h2 id=&quot;definitely&quot;&gt;Definitely &lt;a class=&quot;direct-link&quot; href=&quot;#definitely&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I’ve heard each episode of these podcasts at least one (probably more times), and I definitely listen to them the day they are released. These are the podcasts I follow most religiously and am the most excited about.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/hello-internet_a98ikc.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Hello Internet&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Hello Internet is a podcast hosted by internet educators CGP Grey and vice host Brady Haran. After following both of their works for years, I started listening to HI about a year after it was initially released, and that’s how I got into podcasts. It’s still my all-time favorite podcast.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/cortex_fv6crb.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Cortex&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Myke Hurley from podcast network RelayFM talks to GDP Grey about productivity, tools, and working lives as independent content creators. Cortex is like HI but focussed on how Grey gets things done. I especially like Grey’s advocacy towards being the most productive in the time you work instead of just working all the time. It’s also a great podcasts to learn about tools for productivity such as time-tracking, lists, and everything in between.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/the-unmade-podcast_faatpk.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;The Unmade Podcast&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;The Unmade Podcast is Brady Haran’s foray into the podcasts that never were, along with co-host Tim. In every episode, Brady and Tim discuss imaginative, hilarious ideas for new podcasts. It’s a great podcast to be on the lighter side of things for once.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/how-i-built-this_juo5co.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;How I Built This&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Hosted by Guy Raz from NPR, HIBT is the epitome of startup podcasts. Every episode is an interview with a visionary entrepreneur and builder, talking about their journeys and the ups and the downs that come with it. Instagram, Lyft, Airbnb, AOL, WeWork, BuzzFeed, Starbucks — the innovators behind all of these game-changing ideas share their stories.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/the-daily_j51cfm.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;The Daily&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Until early 2018, Up First from NPR was my go-to morning podcast. Now, The Daily from the New York Times is how I like to start my day. Michael Barbaro and other hosts deliver clear, unfiltered news for 20 minutes, every day from Monday to Friday.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/embedded_c7m41c.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Embedded&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Kelly McEvers takes one story from the news — everything from suicide epidemics to Doctors without Borders to Donald Trump — and digs deep. Embedded is the best way to hear all sides of a story and really go deep into people’s lives, things you wouldn’t learn reading a small article.&lt;/p&gt;&lt;h2 id=&quot;probably&quot;&gt;Probably &lt;a class=&quot;direct-link&quot; href=&quot;#probably&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I usually follow these podcasts, and I’ve probably heard every episode.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/startup_hgrdxc.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Startup&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Co-founder of podcast network Gimlet Media, Alex Blumberg, talks about his journey and ventures into topics like startup funding, scaling, and diversity in the workplace.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/build-your-saas_n90oca.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Build Your SaaS&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Jon Buda and Justin Jackson, founders of podcast hosting platform &lt;a href=&quot;http://transistor.fm/&quot;&gt;Transistor.fm&lt;/a&gt;, talk about what it’s like to build a SaaS startup in 2018. I find the show very interesting and especially relatable.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/newslaundry-hafta_smvs1f.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Newslaundry Hafta&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Newslaundry is a subscription-based news service from New Delhi, India, with the motto “when the public pays, the public is served”. They also feature a weekly podcast called Hafta, which is perhaps my most efficient way to stay in touch with what’s going on back at home.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/the-freecodecamp-podcast_m1bi3p.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;The freeCodeCamp Podcast&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;The freeCodeCamp Podcast generally features audio versions of popular articles on the freeCodeCamp medium publication. It’s a bit &lt;em&gt;basic&lt;/em&gt; but it sometimes features very interesting stories.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/where-should-we-begin_crlryb.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Where Should We Begin?&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Hosted by psychotherapist Esther Perel for NPR, each episode of How Should We Begin? takes us through a private couples’ counselling session.&lt;/p&gt;&lt;h2 id=&quot;generally&quot;&gt;Generally &lt;a class=&quot;direct-link&quot; href=&quot;#generally&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I listen to these podcasts when I have no other podcasts or audiobooks queued.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/in-depth_cvhyxy.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;In Depth&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;In Depth is my favorite “designers talking design” podcast. Eli Schiff and Mike Rundle take you through their reviews of modern designing tools like Sketch and XD, along with commentaries on updates like Dropbox’s redesign.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/ted-radio-hour_kwaymj.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;TED Radio Hour&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;TED Radio Hour features speakers who delivered popular TED talks and goes more in-depth with interviews and more.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/relatively-prime_ada4tg.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Relatively Prime&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Relatively Prime features discussions about interesting topics from the world of mathematics. Everything from statistics theory to modern advancements in classification.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/99-invisible_pd4gdg.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;99% Invisible&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;99% Invisible is a critically acclaimed design podcast in which Roman Mars talks to guests about architecture, visual design, and recent activity from the design domain.&lt;/p&gt;"
    },
    
    {
      "title": "State of the Dock 2018",
      "date_published": "2018-07-28T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/state-of-the/dock/2018/",
      "url": "https://anandchowdhary.com/blog/state-of-the/dock/2018/",
      "content_html": "&lt;p&gt;Two months after writing &lt;a href=&quot;https://anandchowdhary.com/blog/state-of-the/podcasts/2018/&quot;&gt;State of the Podcasts&lt;/a&gt;, where I talked about my go-to podcasts in 2018, this post is about the apps that find their home on my laptop’s dock. These apps are those I use most often and make me much more productive.&lt;/p&gt;&lt;!--more--&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/google-chrome.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Chrome&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;I switched from a Firefox/Opera combination to Chrome as my primary web browser when it was released in late 2008 because it was fast and secure. Today, I use Chrome because it’s still standards-compliant and I’m very deep into the Google ecosystem. Chrome isn’t the fastest browser out there anymore, but I can only switch to a new browser if it’s also made by Google (or another company I can rely upon for cloud storage, email, search, etc., or integrating with Google.)&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/airmail.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Airmail&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;One of the two major switches in 2018 was from Boxy, a Mac client for Inbox by Google, to Airmail 2. This change was part of a large overhaul of my entire email system, but that’s a story for another day. Airmail is fast and efficient, and lets me configure multiple inboxes, signatures, and most other things I need. I still use Inbox on my phone.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/franz.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Franz&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Franz is a native* client for multiple messaging apps. I think of it as a browser with perpetual tabs for apps I need running in the background. I have it configured with multiple Slack workspaces, Facebook Messenger, WhatsApp Web, Google Calendar, and Google Keep. Before Franz, I used similar all-in-one apps.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/vs-code.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;VS Code&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;In 2017, I starting using Visual Studio Code from Microsoft instead of my long-time favorite Sublime Text as my go-to code editor. In the past, I’ve used everything from (then Macromedia) DreamWeaver to fully fledged IDEs, but I fell in love with the customization and extension ecosystem of VS Code. I use the theme Atom One Dark with the ligature typeface Fira Code.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/iterm.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;iTerm2&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;iTerm2 is the terminal replacement I use, primarily because of its features like multiple panes, search, and better themes. Even simple tings like copy-and-paste are simpler in iTerm2 and it’s native to Mac (unlike other Electron-based terminals.)&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/termius.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Termius&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Termius is the most recent addition to my dock. It’s a beautifully-designed SSH client which also lets me store keys and credentials. It’s far better than my previous attempt at SSH management—writing shell scripts and one-liner Slack notes.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/photoshop.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Adobe Photoshop&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Even though I switched to Sketch for UI design when I bought a Mac, Photoshop has been my favorite way to quickly create raster images since I started using the tool even before I turned 10. I like the classics like compression and export options and new features like Content Aware fill.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/sketch.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Sketch&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Sketch, in general, is how I design. I did a freelance app UI design project this year and extensively made use of Sketch. It has a vibrant ecosystem of plugins and an incredibly active community.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/postman.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Postman&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Postman is the best way of developing and sharing REST API endpoints. I use it in almost every project, because it’s simple yet powerful. It’s great for simple POST requests but also great to collaborate on collections of projects with hundreds of endpoints.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/navicat.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Navicat&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;I started using Navicat in 2017 because it lets me use all major database management systems and connect to both local and remote servers. I use it for MySQL on &lt;code&gt;localhost&lt;/code&gt;, Oswald Labs’ MariaDB in production, and PostgreSQL for new projects.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/arduino.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Arduino&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Again, in 2017, I started with physical computing as part of my curriculum in Creative Technology. Today, I use Arduino for everything from university projects to IoT products for clients. I don’t use the Arduino GUI (I have a setup in VS Code), but still need to go to the app to compile and upload (note to self: configure Arduino for VS Code).&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/spotify.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Spotify&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Earlier this year, I &lt;a href=&quot;https://twitter.com/AnandChowdhary/status/997446406901248000&quot;&gt;moved&lt;/a&gt; from Apple Music to Spotify, primarily because Apple Music in India did not give me recommendations I was looking for. Spotify makes me great playlists, lets me download them, and I love features like crossfading and Genius.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/dock/1password.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;1Password&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;1Password is my password manager and generator. I use it for all my online passwords (with the exception of Google and Facebook), credit cards, WiFi password, etc. It’s simple, and works with all my devices.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Screenshot of my dock&quot; src=&quot;https://anandchowdhary.com/images/blog/Screen_Shot_2018-07-28_at_11.27.45_PM.png&quot;&gt;&lt;/div&gt;"
    },
    
    {
      "title": "Google Docs + GitHub",
      "date_published": "2019-03-11T17:44:38+00:00",
      "id": "https://anandchowdhary.com/blog/coffee-time/google-docs-github/",
      "url": "https://anandchowdhary.com/blog/coffee-time/google-docs-github/",
      "content_html": "&lt;p&gt;When I first started using Google Docs, my favorite feature was “smart” autosaving. “Smart” because it’s not just an interval, but also based on content changes. Today, almost all popular web-based text editors have both autosaving (WordPress, Medium, etc.) and rich text formatting (think [f]CKEditor and TinyMCE a decade ago).&lt;/p&gt;&lt;p&gt;The question is — how can I combine the rich text and autosaving aspects with git’s version control, so I can smartly save only the changes to a file and easily go back. Plus, why not write text in Markdown? Everybody loves Markdown.&lt;/p&gt;&lt;p&gt;&lt;a href=&quot;https://github.com/AnandChowdhary/gitwriter&quot;&gt;GitWriter&lt;/a&gt; is an app I made in a couple of hours for exactly that. It’s a frontend-only PWA written in Vue.js and Typescript (decorators and everything!), hosted on Netlify. It connects with your GitHub account (personal access token), you shoose a repository and file, and just write. GitWriter automatically commits your changes as you write every few moments.&lt;/p&gt;"
    },
    
    {
      "title": "Twitter Subaccounts",
      "date_published": "2019-03-12T18:02:42+00:00",
      "id": "https://anandchowdhary.com/blog/coffee-time/twitter-subaccounts/",
      "url": "https://anandchowdhary.com/blog/coffee-time/twitter-subaccounts/",
      "content_html": "&lt;p&gt;I think Twitter should have a concept of sub-accounts. It’s not smart to create a Twitter account for every small project, but it’s often a necessity for support or a social media presence. In my case, I have a &lt;a href=&quot;https://twitter.com/AnandChowdhary&quot;&gt;Twitter account&lt;/a&gt;, and so does &lt;a href=&quot;https://twitter.com/OswaldLabs&quot;&gt;Oswald Labs&lt;/a&gt; (which makes complete sense since it’s a company and I’m just a small part of it).&lt;/p&gt;&lt;p&gt;However, I also have several other projects, like Made with Love in India, a &lt;a href=&quot;https://madewithlove.org.in/&quot;&gt;platform&lt;/a&gt; to showcase Indian-made startups, which has &lt;a href=&quot;https://twitter.com/mwlii&quot;&gt;its own Twitter&lt;/a&gt; account. However, I can’t keep scaling this for every new project (I refrain from saying “startup”, but what I mean is “super-early startup idea which still needs some social media presence”).&lt;/p&gt;&lt;p&gt;The solution: &lt;strong&gt;Twitter Subaccounts&lt;/strong&gt;. I, @AnandChowdhary, can have sub-accounts, like this:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Main account: &lt;a href=&quot;http://twitter.com/AnandChowdhary&quot;&gt;twitter.com/AnandChowdhary&lt;/a&gt;&lt;/li&gt;&lt;li&gt;Subaccount about &lt;a href=&quot;https://github.com/AnandChowdhary/gitwriter&quot;&gt;GitWriter&lt;/a&gt;: &lt;a href=&quot;http://twitter.com/AnandChowdhary/gitwriter&quot;&gt;twitter.com/AnandChowdhary/gitwriter&lt;/a&gt;&lt;/li&gt;&lt;li&gt;Subaccount about whatever: &lt;a href=&quot;http://twitter.com/AnandChowdhary/whatever&quot;&gt;twitter.com/AnandChowdhary/whatever&lt;/a&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;On going to &lt;a href=&quot;http://twitter.com/AnandChowdhary&quot;&gt;twitter.com/AnandChowdhary&lt;/a&gt;, you see the combined timeline of all tweets authored by me, both from the main account and any subaccounts. On &lt;a href=&quot;http://twitter.com/AnandChowdhary/gitwriter&quot;&gt;twitter.com/AnandChowdhary/gitwriter&lt;/a&gt;, you will only see tweets from the GitWriter subaccount. Think of it like adding a tag to your tweets, and a special view to see all tweets with a specific tag.&lt;/p&gt;&lt;p&gt;The second and more important part of subaccounts is that people can not just tag @AnandChowdhary, but also @AnandChowdhary/gitwriter. Now, people can say: “I think @AnandChowdhary/gitwriter is a nice way to quickly add blog posts to my site”, and I know they’re talking about the specific product, not me in general.&lt;/p&gt;&lt;p&gt;I as an individual don’t have to create a separate Twitter account for every single consumer-driven product, service, or open-source project. Larger companies can have subaccounts for categories (e.g., @Samsung/support instead of @SamsungSupport, and @Facebook/design instead of @facebookdesign).&lt;/p&gt;"
    },
    
    {
      "title": "Package Manager Standardization",
      "date_published": "2019-03-15T18:54:59+00:00",
      "id": "https://anandchowdhary.com/blog/coffee-time/package-managers/",
      "url": "https://anandchowdhary.com/blog/coffee-time/package-managers/",
      "content_html": "&lt;p&gt;Matt Turnbull has a great article titled &lt;a href=&quot;https://iamturns.com/yarn-vs-npm-2018/&quot;&gt;Why Are You Still Using Yarn in 2018?&lt;/a&gt; which makes the argument that newer versions of NPM are just as fast as Yarn and switching to NPM might actually have some benefits (I’m still a Yarn user).&lt;/p&gt;&lt;p&gt;Furthermore, it’s &lt;a href=&quot;https://github.com/gatsbyjs/gatsby/issues/4514&quot;&gt;getting complicated&lt;/a&gt; to maintain documentations and say: To install this package, use &lt;code&gt;npm install package&lt;/code&gt; or &lt;code&gt;yarn add package&lt;/code&gt;, etc. With other great package managers on the horizon like &lt;a href=&quot;https://pnpm.js.org/&quot;&gt;PNPM&lt;/a&gt; which claims to be faster than both NPM and Yarn, docs are going to get even harder to maintain.&lt;/p&gt;&lt;p&gt;The solution: &lt;strong&gt;Package manager standardization&lt;/strong&gt;. Just like with &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions&quot;&gt;browser extensions&lt;/a&gt; became a standard so developers could write extensions for multiple browsers, we can have a standard for package managers. To use storage in a a Chrome extension, you can use the API &lt;code&gt;chrome.storage&lt;/code&gt; or &lt;code&gt;browser.storage&lt;/code&gt;, both work.&lt;/p&gt;&lt;p&gt;Similarly, instead of &lt;code&gt;npm install package&lt;/code&gt; and &lt;code&gt;yarn add package&lt;/code&gt; and &lt;code&gt;pnpm i package&lt;/code&gt;, you can do:&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-bash&quot;&gt;package-manager install package&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;or, even more interesting:&lt;/p&gt;&lt;pre&gt;&lt;code class=&quot;language-bash&quot;&gt;package-manager + package&lt;/code&gt;&lt;/pre&gt;&lt;p&gt;Based on your local configuration, this can be translated to &lt;code&gt;npm install package&lt;/code&gt; or &lt;code&gt;yarn add package&lt;/code&gt;. Both package managers (and all package managers) will use the same verbs — and even if they don’t, at least have aliases to the standards.&lt;/p&gt;&lt;p&gt;The standard commands can be &lt;code&gt;install&lt;/code&gt; (or &lt;code&gt;+&lt;/code&gt;), &lt;code&gt;remove&lt;/code&gt; (or &lt;code&gt;-&lt;/code&gt;), and &lt;code&gt;update&lt;/code&gt; (or &lt;code&gt;^&lt;/code&gt;). Then, developer documentations can be as simple as “Add our package: &lt;code&gt;package-manager + package&lt;/code&gt; and start using it.”&lt;/p&gt;"
    },
    
    {
      "title": "Quarter of Open Source",
      "date_published": "2019-04-04T10:01:23+00:00",
      "id": "https://anandchowdhary.com/blog/quarter-of-open-source/",
      "url": "https://anandchowdhary.com/blog/quarter-of-open-source/",
      "content_html": "&lt;p&gt;The first quarter of 2019 was very interesting for me. It was the first time I did a lot of open-source work as a way to scratch my own itch. Every time I thought I needed a specific tool which I couldn’t find, I built and open-sourced it.&lt;/p&gt;&lt;!--more--&gt;&lt;h2 id=&quot;background&quot;&gt;Background &lt;a class=&quot;direct-link&quot; href=&quot;#background&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;The number of contributions I’ve made on GitHub has increased by over 20x in the past few years.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Graph of contributions&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/contributions.png&quot;&gt;&lt;/div&gt;&lt;h3 id=&quot;2015&quot;&gt;2015 &lt;a class=&quot;direct-link&quot; href=&quot;#2015&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;In 2015, I made slightly more than 100 contributions. These were mostly on my own projects, like my personal website, &lt;a href=&quot;https://anandchowdhary.com/projects/made-with-love-in-india/&quot;&gt;Made with Love in India&lt;/a&gt;, and &lt;a href=&quot;https://anandchowdhary.com/projects/saga-music/&quot;&gt;Saga Music&lt;/a&gt;. This is still less than 2014 (when I made a few projects centered around CSS and WordPress), but it’s still something.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Contributions in 2015&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/2015.png&quot;&gt;&lt;/div&gt;&lt;h3 id=&quot;2016&quot;&gt;2016 &lt;a class=&quot;direct-link&quot; href=&quot;#2016&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;2016 was better, with more than twice the number of contributions. This is also when I founded Oswald Labs, so some of that work went into building our websites and first open-source extension.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Contributions in 2016&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/2016.png&quot;&gt;&lt;/div&gt;&lt;h3 id=&quot;2017&quot;&gt;2017 &lt;a class=&quot;direct-link&quot; href=&quot;#2017&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;2017 was even better with 465 contributions. In the first half of the year, I was working full-time on Oswald Labs (along with some freelance projects), and moved to Enschede in the second half. I also participated in (and won!) two hackathons, whose projects I also open-sourced. Oswald Labs mostly worked on GitLab, so there are (scattered) contributions here and there.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Contributions in 2017&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/2017.png&quot;&gt;&lt;/div&gt;&lt;h3 id=&quot;2018&quot;&gt;2018 &lt;a class=&quot;direct-link&quot; href=&quot;#2018&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;Last year is when there was a substantial, 6x increase in my open-source work. With over 2,500 contributions, this was the first time I was in four-figures, and my work was mostly on personal projects and a few libraries.&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Contributions in 2018&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/2018.png&quot;&gt;&lt;/div&gt;&lt;h3 id=&quot;2019&quot;&gt;2019 &lt;a class=&quot;direct-link&quot; href=&quot;#2019&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;Finally, as of the first quarter of this year, I already have over 1,500 contributions. These are split around both Oswald Labs and my personal projects, and I also made a &lt;a href=&quot;https://github.com/AnandChowdhary/anand-services&quot;&gt;system&lt;/a&gt; to count my GitLab commits. At this rate, I should hit 5,000 this year (thought I don’t know how long I can keep this rate up).&lt;/p&gt;&lt;div class=&quot;image&quot;&gt;&lt;img alt=&quot;Contributions in 2019&quot; src=&quot;https://anandchowdhary.com/images/blog/quarter-of-open-source/2019.png&quot;&gt;&lt;/div&gt;&lt;h2 id=&quot;projects&quot;&gt;Projects &lt;a class=&quot;direct-link&quot; href=&quot;#projects&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;These are the projects I’ve built in the first quarter of 2019. In this section, I’m counting a little bit of December 2018 and a few days in April 2019 as the first quarter too, because I started some projects a few days before 2019 began, and finished one a day in April.&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%93%9D-hovercard&quot;&gt;📝 Hovercard &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%93%9D-hovercard&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; For a hackathon project, my team and I made &lt;a href=&quot;https://anandchowdhary.com/projects/aristotle/&quot;&gt;Aristotle&lt;/a&gt;, an e-learning system. For this, I wanted a way to show Wikipedia summary cards for important terms.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A DOM library to show Wikipedia summary cards using Wikipedia’s API. JavaScript, December 2018 · &lt;a href=&quot;https://github.com/AnandChowdhary/hovercard&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/hovercard&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%91%8B-hello-bar&quot;&gt;👋 Hello-Bar &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%91%8B-hello-bar&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; The Hello Bar service is expensive, and Oswald Labs needed a way to show targeted announcement bars with important information to visitors.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A package to show targeted hello bars. JavaScript, January 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/hello-bar&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/hello-bar&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%E2%99%BF-accessible-web-component(s)&quot;&gt;♿ Accessible Web Component(s) &lt;a class=&quot;direct-link&quot; href=&quot;#%E2%99%BF-accessible-web-component(s)&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; There’s a lot of boilerplate to make inputs with labels (&lt;code&gt;id&lt;/code&gt;, &lt;code&gt;for&lt;/code&gt;), and I wanted a web component to automate that&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A web component, &lt;code&gt;&amp;lt;form-group&amp;gt;&lt;/code&gt; to automate labels and IDs. JavaScript, January 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/accessible-web-components&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/accessible-web-components&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;Around this time is also when I learned TypeScript, so the projects after late-January are not in ES6.&lt;/em&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%93%85-calendar-link&quot;&gt;📅 Calendar Link &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%93%85-calendar-link&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; For an AI scheduling assistant I’m working on, I wanted a way to send platform-agnostic calendar invitation links.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A Node.js library for generating links for Google, Yahoo!, and Outlook calendars. TypeScript, January 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/calendar-link&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/calendar-link&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%8C%90-auto-i18n&quot;&gt;🌐 Auto I18N &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%8C%90-auto-i18n&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; It’s hard to translate JSON files using Google Translate, especially if they have nested items. However, this is a necessity if you can’t afford to pay human translators and still need localization.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A Node.js utility to translate works, objects, and files using Google Translate. TypeScript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/auto-i18n&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/auto-i18n&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%93%A6-typestart&quot;&gt;📦 Typestart &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%93%A6-typestart&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; With me making so many DOM libraries in TypeScript, I wanted a easy-to-use, no-configuration starter with didn’t have tons of boilerplate code.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A TypeScript starter for libraries with DOM support and tests using Jest. TypeScript, February 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/typestart&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/typestart&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%94%94-changebar&quot;&gt;🔔 Changebar &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%94%94-changebar&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; I wanted a plugin to show users the most recent updates and features on Agastya’s admin panel.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A notifications widget to show changelogs, powered by Markdown files hosted on GitHub. TypeScript, February 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/changebar&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/changebar&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%90%A6-a11y-is-important&quot;&gt;🐦 A11Y is Important &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%90%A6-a11y-is-important&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; I wanted to build a Twitter bot (never did that before), and also wanted to curate a timeline related to accessibility.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A Twitter bot which tweets and follow #a11y-related people and things. TypeScript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/a11yisimportant&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/a11yisimportant&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%90%8E-twente-license&quot;&gt;🐎 Twente License &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%90%8E-twente-license&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; The MIT license is great, but I wanted to add values like privacy to it, to ensure that my code isn’t used for evil.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A fork of the MIT license with an added paragraph about privacy, along with a static site generator to show it off. TypeScript, January 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/twente-license&quot;&gt;GitHub&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%97%84-fraud&quot;&gt;🗄 Fraud &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%97%84-fraud&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; MongoDB is an overkill for simple key-value storages, and I wanted a git-based backup system to store and manage Oswald Labs’ developer API keys.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; JSON file-powered key-value storage with cache; super fast, always available. TypeScript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/fraud&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/fraud&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%93%9D-gitwriter&quot;&gt;📝 GitWriter &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%93%9D-gitwriter&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; I wanted to write my &lt;a href=&quot;https://github.com/AnandChowdhary/writing/blob/master/honors-veni-proposal.md&quot;&gt;honors research proposal&lt;/a&gt;, but on GitHub with auto-saving.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A progressive web app to write text in Markdown on GitHub, auto-saving and cross-platform. Vue, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/gitwriter&quot;&gt;GitHub&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%94%97-sharer.link&quot;&gt;🔗 Sharer.link &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%94%97-sharer.link&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; I wanted to share links to my favorite podcasts with my friends, but didn’t know which podcast player they prefer.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A web app to share links for podcasts, songs, movies, and more, with support for most major apps and stores. Vue, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/sharer.link&quot;&gt;GitHub&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%97%83-embed-widget&quot;&gt;🗃 Embed Widget &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%97%83-embed-widget&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; Many websites these days want to embed tiny live chat or support widgets to their websites, and most of them live in &lt;code&gt;iframe&lt;/code&gt;s. I wanted a starter for that.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A button widget to open and manipulate embedded frames on webpages. Typescript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/embed-widget&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/embed-widget&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%8E%A8-prefers-color-scheme&quot;&gt;🎨 Prefers Color Scheme &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%8E%A8-prefers-color-scheme&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; In macOS Mojave, users can choose their preferred color scheme (dark or light), and I wanted a way to see which theme a user has selected.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A DOM utility to get a user’s preferred color scheme. TypeScript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/prefers-color-scheme&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/prefers-color-scheme&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%93%B7-photomonster&quot;&gt;📷 Photomonster &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%93%B7-photomonster&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; I want to backup my phone’s photos, but to my own S3 instance because I’m afraid to lose them (I already pay for Google Photos, but I’m paranoid about data loss).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; An app to backup photos to S3, Firebase Storage, or custom endpoints. Work in progress. React Native, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/photomonster&quot;&gt;GitHub&lt;/a&gt;&lt;/p&gt;&lt;h3 id=&quot;%F0%9F%88%B9-language-icons&quot;&gt;🈹 Language Icons &lt;a class=&quot;direct-link&quot; href=&quot;#%F0%9F%88%B9-language-icons&quot;&gt;#&lt;/a&gt;&lt;/h3&gt;&lt;p&gt;&lt;strong&gt;Itch:&lt;/strong&gt; Flags aren’t good icons for languages. For example, should I use the US or the UK flag? Why not Pakistan’s? They have more English speakers than the UK.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Scratch:&lt;/strong&gt; A generator for language icons using their codes and flag colors. TypeScript, March 2019 · &lt;a href=&quot;https://github.com/AnandChowdhary/language-icons&quot;&gt;GitHub&lt;/a&gt; · &lt;a href=&quot;https://npmjs.com/package/language-icons&quot;&gt;NPM&lt;/a&gt;&lt;/p&gt;&lt;h2 id=&quot;epilogue&quot;&gt;Epilogue &lt;a class=&quot;direct-link&quot; href=&quot;#epilogue&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I made the most contributions I’ve ever made (per day) in the first quarter of 2019. I learned a lot (like TypeScript! I love TypeScript!) this quarter too, so it was a great start to an important year.&lt;/p&gt;&lt;p&gt;Of course, the number of contributions is not a great way to measure impact. It depends on how much code is in each commit, and how much it’s truly adding to the open-source community. But, all in all, I’m happy with the way things are going and hope to continue to do my small part to build the ecosystem.&lt;/p&gt;"
    },
    
    {
      "title": "State of the Podcasts 2019",
      "date_published": "2019-06-12T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/state-of-the/podcasts/2019/",
      "url": "https://anandchowdhary.com/blog/state-of-the/podcasts/2019/",
      "content_html": "&lt;p&gt;This is the second year of my annual State of the Podcasts list, where I highlight my daily drivers of audio content. This time last year, I published &lt;a href=&quot;https://anandchowdhary.com/blog/state-of-the/podcasts/2018/&quot;&gt;State of the Podcasts 2018&lt;/a&gt;, and not too much has changed. Let’s see what has.&lt;/p&gt;&lt;!--more--&gt;&lt;h2 id=&quot;new-and-noteworthy&quot;&gt;New and noteworthy &lt;a class=&quot;direct-link&quot; href=&quot;#new-and-noteworthy&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;These are the podcasts I’ve started listening to in the past year.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/unbox.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Unbox&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Made by Ratik Sharma (who is my good friend, full disclosure), Unbox is the 🏆 &lt;strong&gt;Best New Podcast&lt;/strong&gt; of 2019. &lt;a href=&quot;https://podcasts.apple.com/gb/podcast/unbox/id1407485570&quot;&gt;Listen to it here&lt;/a&gt;. It takes you through the tough decisions you make growing up in modern India, with a focus on the state of education and talent. Especially for high-school students, this is my most-recommended podcast.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/instant-message.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Instant Message&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Instant Message showcases The Wall Street Journal’s perspective on technology trends, so it’s like listening to the news from the best journalists while taking a deep dive into the socioeconomic aspects of them all.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/a16z.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;a16z&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Everyone knows a16z as one of the most important VCs in the Valley, so it’s especially interesting to hear their conversations with founders about what to (and what not to) do.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/heavyweight.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Heavyweight&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Every episode of Heavyweight is an auditory adventure with Jonathan Goldstein. He goes through past experiences as a pseudo-therapist-investigator to heal old wounds. It’s hilarious, and also the closest that a podcast has ever come to dethroning Hello Internet as my all-time favorite podcast.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/clockwise.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Clockwise&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;This is my go-to podcast when biking from home to university. Each episode is 30 minutes, which is 20 minutes at &lt;code&gt;1.5x&lt;/code&gt;, exactly the duration of my my bike ride every morning. It covers four tech news topics in each episode with various guests.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/codeish.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Code[ish]&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Heroku is my favorite PaaS company, and their recently-launched podcast covers web development and devops. It’s a great listen, albeit with plenty of Heroku promotion.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/numberphile.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Numberphile&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Just like Brady Haran’s other podcasts, Numberphile is definitely one of the best ones out there for mathematics enthusiasts. Each episode is a private conversation with a mathematician.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/talkscript.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;TalkScript&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;I started writing TypeScript in early 2019, and TalkScript is my favorite place to follow TypeScript updates, hear about new proposals, and learn new parts of the language.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/travel-genius.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Travel Genius&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;I’ve been on 13 flights in the past year, and I’m certain that Travel Genius has the best tips on how to travel — everything from small local tourism hacks to efficient luggage packing tips.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/connected.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Connected&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;This is my podcast for staying up to date with everything Apple. I also used to listen to Material (for Google) from RelayFM, but I find the playfulness of Connected’s hosts addicting.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/works-for-me.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Works for Me&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Bloomberg’s Works for Me, interviews people and comes up with just the most interesting tips and life hacks. It’s a relatively new addition to my list, but it works for me. :wink:&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/without-fail.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Without Fail&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Gimlet founder and Planet Money creator Alex Blumberg doesn’t do podcasts lately, but when he does, they’re worth listening to. In this, he interviews successful CEOs on their biggest mistakes.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/character-count.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;Character Count&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Twitter’s debut podcast, Character Count, is a great place to hear about marketing tips and optimizations, and how to optimize Twitter. Unfortunately, the SMO is limited to Twitter, but well worth it.&lt;/p&gt;&lt;h3 class=&quot;img-heading&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/http-203.png&quot; alt=&quot;&quot;&gt;  &lt;span&gt;HTTP 203&lt;/span&gt;&lt;/h3&gt;&lt;p&gt;Google’s HTTP 203 is one of my favorite YouTube series on front-end web development, and its podcast form goes in-depth in new web standards and interesting ideas.&lt;/p&gt;&lt;h2 id=&quot;2018-and-beyond&quot;&gt;2018 and beyond &lt;a class=&quot;direct-link&quot; href=&quot;#2018-and-beyond&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I’m still listening to these podcasts from State of the Podcasts 2018:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Hello Internet (still my favorite)&lt;/li&gt;&lt;li&gt;Cortex&lt;/li&gt;&lt;li&gt;The Unmade Podcast&lt;/li&gt;&lt;li&gt;How I Built This&lt;/li&gt;&lt;li&gt;Embedded&lt;/li&gt;&lt;li&gt;The freeCodeCamp Podcast&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;player&quot;&gt;Player &lt;a class=&quot;direct-link&quot; href=&quot;#player&quot;&gt;#&lt;/a&gt;&lt;/h2&gt;&lt;p&gt;I still use Pocket Casts as my primary podcast player. This is what my “Podcasts” screen looks like:&lt;/p&gt;&lt;div class=&quot;three-images&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/2019-0.png&quot; alt=&quot;Screenshot of podcasts&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/2019-1.png&quot; alt=&quot;Screenshot of podcasts&quot;&gt;  &lt;img src=&quot;https://anandchowdhary.com/images/blog/state-of-the/podcasts/2019-2.png&quot; alt=&quot;Screenshot of stats&quot;&gt;&lt;/div&gt;"
    },
    
    {
      "title": "New Google Play Badges",
      "date_published": "2019-08-31T12:05:38+00:00",
      "id": "https://anandchowdhary.com/blog/coffee-time/google-play-badges/",
      "url": "https://anandchowdhary.com/blog/coffee-time/google-play-badges/",
      "content_html": "&lt;p&gt;When you’re advertising your smartphone app, perhaps the first thing you show off are platform badges. They’re the easiest and most familiar way to tell users where they can find your app. All major platforms, Apple’s App Store, Google Play, and Microsoft Store have official badges which are somewhat consistent with each other.&lt;/p&gt;&lt;p&gt;However, these badges aren’t &lt;em&gt;that&lt;/em&gt; consistent. For example, Google shows the icon of Google Play (the distribution system), whereas Apple and Microsoft show their corporate logos (Apple previously had an iPhone shape as the icon).&lt;/p&gt;&lt;p&gt;&lt;img src=&quot;https://anandchowdhary.com/images/blog/google-play-badges/official-badges.png&quot; alt=&quot;Current badges&quot;&gt;&lt;/p&gt;&lt;p&gt;For now, I’ll only look at the two major smartphone platforms, Android and iOS/iPadOS. Apple’s icon is one of the most recognizable icons in the world, so it makes sense for them to use it on their badges, but I don’t think I can say the same for Google Play. On the contrary, I think the Android icon in incredibly familiar to most people, &lt;a href=&quot;https://www.blog.google/products/android/evolving-android-brand/&quot;&gt;Android rebranding announcement&lt;/a&gt;:&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;The design of the logo draws inspiration from the most recognizable non-human member of the community, the Android robot.&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;That’s why I think that the “Get it on Google Play” badge should be changed to showcase the Android icon, not the Google Play icon. &lt;strong&gt;The distribution system is irrelevant, the platform is what matters.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=&quot;https://anandchowdhary.com/images/blog/google-play-badges/badge-proposal.png&quot; alt=&quot;Proposed badges&quot;&gt;&lt;/p&gt;&lt;p&gt;Similar icons can also be made using the Google Play Music, Movies, and Books icons.&lt;/p&gt;"
    },
    
    {
      "title": "Introducing Uppload v2",
      "date_published": "2020-01-03T00:00:00+00:00",
      "id": "https://anandchowdhary.com/blog/introducing-uppload-v2/",
      "url": "https://anandchowdhary.com/blog/introducing-uppload-v2/",
      "content_html": "&lt;p&gt;In April 2018, I made the first commit to Uppload (&lt;a href=&quot;https://github.com/elninotech/uppload/commit/56bd9307a020c692ed1383f0f4731690c00d90c9&quot;&gt;56bd930&lt;/a&gt;) and pitched it as an idea to Michael, the founder of El Niño, to fund the development of an open-source JavaScript file uploader, something that the web desperately needed. Later that summer, we launched Uppload and started using it in our projects.&lt;/p&gt;&lt;p&gt;Today, I’m proud to launch &lt;a href=&quot;https://anandchowdhary.com/projects/open-source/uppload/&quot;&gt;&lt;strong&gt;Uppload v2&lt;/strong&gt;&lt;/a&gt;, a rewrite from the group up in TypeScript, with support for over 30 a-la-carte plugins, keeping the same powerful API, easy-to-use interface, and browser support.&lt;/p&gt;"
    }
  ]
}
